Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c

/*
 * Copyright (C) 2019, 2021 Regents of University of Colorado
 * Written by Gedare Bloom <gbloom@uccs.edu>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/can.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

#include "saebench.h"
#include "experiment.h"


//----------------------------------------------------------------------------
// Modify anything below with care!
//----------------------------------------------------------------------------

// System clock rate in Hz, set in main() to 120 MHz
uint32_t g_ui32SysClock;
#define SYSCLK (120000000)
#define TICKS_PER_MS (SYSCLK/1000)
#define TICKS_PER_US (TICKS_PER_MS/1000)
#define TICKS_PER_BIT (SYSCLK/BITRATE)
#define INTERVAL (TICKS_PER_MS*5)   // 5 ms in 120 MHz ticks
#define LATENCY_8B_MAX (129*TICKS_PER_BIT) /* maximum message latency */

// counters
volatile uint32_t g_ui32RXMsgCount = 0;
volatile uint32_t g_ui32TXMsgCount = 0;

// flags used by interrupt handlers
volatile uint32_t g_ui32ErrFlag = 0;
volatile bool g_bRXFlag = 0;
volatile bool g_bTXFlag = 0;
volatile bool g_bTXFlag_5 = 0;
volatile bool g_bTXFlag_10 = 0;
volatile bool g_bTXFlag_100 = 0;
volatile bool g_bTXFlag_1000 = 0;
volatile bool g_bTXTarget_1 = 0;
volatile bool g_bTXTarget_2 = 0;
volatile bool g_bRESETFlag = 0;
volatile bool g_tick = false;
volatile bool g_tick_2 = false;

uint32_t g_last_target_rcv = 0;
uint32_t g_last_sporadic_tx = 0;

/* Synchronization works on a simple state machine.
 * The initial state is SYNC_MODE_INIT. Transition goes from this state to SYNC_MODE RESET after some delay from start.
 * The reset state is SYNC_MODE_RESET. In this state, the attacker node attempts to resynchronize with the victim.
 * The adjustment state is SYNC_MODE_ADJUST. In this state, the attacker is resynchronizing to the victim by adjusting the periodic timers.
 * The synchronized state is SYNC_MODE_SYNCHED. This state is reached after the adjustment completes.
 */
#define SYNC_MODE_INIT       (0)
#define SYNC_MODE_SYNCHED    (1)
#define SYNC_MODE_RESYNCH    (2)    // UNUSED
#define SYNC_MODE_ADJUST     (3)
#define SYNC_MODE_RESET      (4)
volatile uint8_t g_sync = SYNC_MODE_INIT;

volatile bool g_reset = false;
volatile uint8_t g_msg_since_idle = 0;

// LED toggling states
volatile uint8_t g_pin0 = 0;
volatile uint8_t g_pin_2 = 0;

// keep track of interrupt event times
volatile uint32_t g_ui32LastCANIntTimer = 0;
volatile uint32_t g_ui32PenultimateCANIntTimer = 0;

// adds delay on reset
volatile uint32_t g_offset = 0;

// the (current) ID to attack
volatile uint32_t g_target_id = 0;
volatile uint32_t g_ui32TargetXmitTime = 0;
volatile uint8_t g_skip_attack = SKIP_ATTACK;

#define NUM_PATTERN_HP (1)
#define TYPE_I_ATTACK (1)
#define TYPE_II_ATTACK (2)
#define TYPE_III_ATTACK (3)
struct pattern {
    uint32_t time;
    uint8_t type;
};
struct pattern attack_patterns[NUM_PATTERN_HP][HYPERPERIOD / TARGET_PERIOD] = {0};
volatile int g_current_pattern = -1;
volatile int g_current_pattern_index = 0;
volatile int g_th = -1, g_tl = -1;
volatile uint32_t g_hp_base = 0;

// Determine the relative priorities of the TARGET_ID, TARGET_ID_2, and the highest priority message normally sent.
#if defined(USE_CASE_ALIGN_WITH_LOWER_PRIORITY)

// FIXME: This is hard-coded to demonstrate attack behavior for Trans attacking Brakes
#define PRIORITY_Target_1 (MID_PRIO)
#define HIGHEST_TX_PRIORITY (HIGH_PRIO)
#define PRIORITY_Target_2 (LOW_PRIO)

#else

#if (HIGH_PRIO_ID < TARGET_ID && TARGET_ID < TARGET_ID_2)
#define PRIORITY_Target_1 (MID_PRIO)
#define HIGHEST_TX_PRIORITY (HIGH_PRIO)
#define PRIORITY_Target_2 (LOW_PRIO)
#elif (HIGH_PRIO_ID < TARGET_ID_2 && TARGET_ID_2 < TARGET_ID)
#define PRIORITY_Target_1 (LOW_PRIO)
#define HIGHEST_TX_PRIORITY (HIGH_PRIO)
#define PRIORITY_Target_2 (MID_PRIO)
#elif (TARGET_ID < HIGH_PRIO_ID  && HIGH_PRIO_ID < TARGET_ID_2)
#define PRIORITY_Target_1 (HIGH_PRIO)
#define HIGHEST_TX_PRIORITY (MID_PRIO)
#define PRIORITY_Target_2 (LOW_PRIO)
#elif (TARGET_ID_2 < HIGH_PRIO_ID  && HIGH_PRIO_ID < TARGET_ID)
#define PRIORITY_Target_1 (LOW_PRIO)
#define HIGHEST_TX_PRIORITY (MID_PRIO)
#define PRIORITY_Target_2 (HIGH_PRIO)
#elif (TARGET_ID < TARGET_ID_2)
#define PRIORITY_Target_1 (HIGH_PRIO)
#define HIGHEST_TX_PRIORITY (LOW_PRIO)
#define PRIORITY_Target_2 (MID_PRIO)
#else
#define PRIORITY_Target_1 (MID_PRIO)
#define HIGHEST_TX_PRIORITY (LOW_PRIO)
#define PRIORITY_Target_2 (HIGH_PRIO)
#endif

#endif

