Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
        if ( count % 200 == 0 ) {
            g_pin0 ^= 1;
            GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, g_pin0);
            if (g_sCAN0TxMessage_1000) {
                CANMessageSet(CAN0_BASE, TXOBJECT_1000, g_sCAN0TxMessage_1000, MSG_OBJ_TYPE_TX);
            }

            if (g_ui32ExpCtrl & SYNC_SBA) {
                if (count > 0 && g_current_pattern < NUM_PATTERN_HP) {
                    ++g_current_pattern;
                }
                g_current_pattern_index = 0;
                g_hp_base = TimerValueGet(TIMER3_BASE, TIMER_A);
                if (g_current_pattern >= NUM_PATTERN_HP) {
                    uint32_t time = attack_patterns[0][g_current_pattern_index].time;    // FIXME: add optimizations
                    TimerLoadSet(TIMER1_BASE, TIMER_A, time - TARGET_XMIT_TIME/2); // FIXME: MAGIC?
                    TimerEnable(TIMER1_BASE, TIMER_A);
                }
            }
        }
    }

#if defined(SEND_RESET)
#define SECONDS(x) (200*x)
#define RESET_PERIOD SECONDS(RESET_PERIOD_SECONDS)
    if ( count % RESET_PERIOD == 0 ) {
        g_ui8TXMsgData_RESET[0] = (g_ui8TXMsgData_RESET[0] + 1) % 256;
        CANMessageSet(CAN0_BASE, TXOBJECT_RESET, &g_sCAN0TxMessage_RESET, MSG_OBJ_TYPE_TX);
    }
#endif

}

void send_messages_2(uint32_t count)
{
    if ( count % 200 == 0 ) {
        g_pin_2 ^= 1;
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, g_pin_2);
    }
}

void Timer0IntHandler(void)
{
    TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
    g_tick = true;

#if 0
    if (g_ui32ExpCtrl & (SYNC_0PHASE | SYNC_PERIOD)) {
        if (g_sync == SYNC_MODE_RESYNCH) {
            TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
            g_sync = SYNC_MODE_SYNCHED;
        }
    } else {
        g_sync = SYNC_MODE_SYNCHED;
    }
#endif
}

void Timer1IntHandler(void)
{
    //uint32_t count;
    uint32_t time;
    uint8_t type;

    TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
    //g_tick_2 = true;

    if ( g_current_pattern_index < (HYPERPERIOD / TARGET_PERIOD) ) {
        type = attack_patterns[g_current_pattern][g_current_pattern_index].type;
        time = attack_patterns[0][g_current_pattern_index].time;
        g_current_pattern_index++;

        time = attack_patterns[0][g_current_pattern_index].time - time;    // FIXME: add optimizations
        TimerLoadSet(TIMER1_BASE, TIMER_A, time + TARGET_XMIT_TIME/2); // FIXME: MAGIC?
        TimerEnable(TIMER1_BASE, TIMER_A);

        // TODO: need to do anything else based on the "type"?
        if (type == TYPE_I_ATTACK || type == TYPE_II_ATTACK) {
            do_attack_injection();
        }
    }


}

void Timer2IntHandler(void)
{
    TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
    TimerEnable(TIMER0_BASE, TIMER_A);

    TimerIntDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    if (g_sync == SYNC_MODE_INIT) {
        TimerLoadSet(TIMER2_BASE, TIMER_A, LATENCY_8B_MAX);
        TimerEnable(TIMER2_BASE, TIMER_A);
        g_sync = SYNC_MODE_RESET;
    } else if (g_sync == SYNC_MODE_ADJUST) {
        TimerDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
        g_sync = SYNC_MODE_SYNCHED;
        g_tick = true;  // TODO maybe too much jitter for the first injection?
    } else {
        // this really shouldn't happen, but let's poll timer 2.
        TimerLoadSet(TIMER2_BASE, TIMER_A, LATENCY_8B_MAX);
    }
}

void ResetCAN0(void)
{
    CANInit(CAN0_BASE);

    if (g_ui32ExpCtrl & DISABLE_RETRANS_AUTO) {
        CANRetrySet(CAN0_BASE, false);
    }

    CANBitRateSet(CAN0_BASE, g_ui32SysClock, BITRATE);
    CANIntEnable(CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR | CAN_INT_STATUS);
    IntEnable(INT_CAN0);
    CANEnable(CAN0_BASE);
    CANMessageSet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, MSG_OBJ_TYPE_RX);
}

void InitCAN0(void)
{
    // CAN0 uses GPIO ports A0 and A1.
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    GPIOPinConfigure(GPIO_PA0_CAN0RX);
    GPIOPinConfigure(GPIO_PA1_CAN0TX);
    GPIOPinTypeCAN(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN0);
    ResetCAN0();
}

void
CANErrorHandler(void)
{

    if (g_ui32ErrFlag & CAN_STATUS_BUS_OFF) {
        uint32_t ui32Status;

        UARTprintf("ERROR: CAN_STATUS_BUS_OFF\n");

        // on bus-off, set an LED pin and reset
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 1);
        CANEnable(CAN0_BASE);
        do {
            ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);
        } while ( ui32Status & CAN_STATUS_BUS_OFF);
        g_reset = true;     // this disables any more attacking until a RESET happens

        // turn off the LED after recovery
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0);

        g_ui32ErrFlag &= ~(CAN_STATUS_BUS_OFF);
    }

    if (g_ui32ErrFlag & CAN_STATUS_EWARN) {
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 1);
        g_ui32ErrFlag &= ~(CAN_STATUS_EWARN);
    } else {
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 0);
    }

    if (g_ui32ErrFlag & CAN_STATUS_EPASS) {
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 1);
        g_ui32ErrFlag &= ~(CAN_STATUS_EPASS);
    }

    if (g_ui32ErrFlag & CAN_STATUS_RXOK) {
        g_ui32ErrFlag &= ~(CAN_STATUS_RXOK);
    }

    if (g_ui32ErrFlag & CAN_STATUS_TXOK) {
        g_ui32ErrFlag &= ~(CAN_STATUS_TXOK);
    }

    if (g_ui32ErrFlag & CAN_STATUS_LEC_STUFF) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_STUFF);
    }

    if(g_ui32ErrFlag & CAN_STATUS_LEC_FORM) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_FORM);
    }

    if(g_ui32ErrFlag & CAN_STATUS_LEC_ACK) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_ACK);
    }

    if (g_ui32ErrFlag & CAN_STATUS_LEC_BIT1) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_BIT1);
    }

    if (g_ui32ErrFlag & CAN_STATUS_LEC_BIT0) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_BIT0);
    }

    if (g_ui32ErrFlag & CAN_STATUS_LEC_CRC) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_CRC);
    }

    if (g_ui32ErrFlag & CAN_STATUS_LEC_MASK) {
        g_ui32ErrFlag &= ~(CAN_STATUS_LEC_MASK);
    }

    if (g_ui32ErrFlag != 0) {
#if defined(VERBOSE)
        UARTprintf("ERROR: Unknown/Unhandled: %x \n",g_ui32ErrFlag);
#endif
    }
}

void
ConfigureUART2(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART2);
    GPIOPinConfigure(GPIO_PD4_U2RX);
    GPIOPinConfigure(GPIO_PD5_U2TX);
    GPIOPinTypeUART(GPIO_PORTD_BASE, GPIO_PIN_4 | GPIO_PIN_5);
    UARTStdioConfig(2, 115200, g_ui32SysClock);
}

