Ipsitakoley/tm4c129-canbus/sae-benchmark/timers.c
    initialize();


    // Start the clocks
    TimerEnable(TIMER0_BASE, TIMER_A);
    // TimerEnable(TIMER1_BASE, TIMER_A);
    // TimerEnable(TIMER2_BASE, TIMER_A);
    TimerEnable(TIMER3_BASE, TIMER_A);

    // Whenever the "RESET" node reboots, reset everyone else.
#if defined(SEND_RESET)
    CANMessageSet(CAN0_BASE, TXOBJECT_RESET, &g_sCAN0TxMessage_RESET, MSG_OBJ_TYPE_TX);
#endif

    // main loop
    while(1) {
        if (g_bRESETFlag) {
            g_bRESETFlag = false;
            // this flag is set when this node transmitted the reset message
            do_reset(count, count_2, g_ui8TXMsgData_RESET[0]);
            count = count_2 = 0;
        }

        if (g_tick == true) {
            g_tick = false;
            send_messages(++count);
        }

        if (g_tick_2 == true) {
            g_tick_2 = false;
         //   send_messages_2(++count_2);
        }

        if (g_bTXTarget_1) {
            g_bTXTarget_1 = false;
            if (g_ui32ExpCtrl & ATTACK_TRANSITIVE) {
                if (g_target_id == TARGET_ID) {
                    do_switch(count);
                } else {
                    if (PRECEDED_ID_2 == TARGET_ID) {
                        if (g_ui32ExpCtrl & DISABLE_RETRANS_RXPM) {
                            delay_ticks(RXPM_DELAY_BITS*TICKS_PER_BIT);
                            CANMessageClear(CAN0_BASE, TXOBJECT_Target_2);
                        }
                    }
                }
            }
            got_tx_message(TARGET_ID, count, &g_sCAN0TxMessage_Target_1);
        }

        if (g_bTXTarget_2) {
            g_bTXTarget_2 = false;
            got_tx_message(TARGET_ID_2, count, &g_sCAN0TxMessage_Target_2);
        }

        if (g_bTXFlag_5) {
            g_bTXFlag_5 = false;
            got_tx_message(TX_5_ID, count, g_sCAN0TxMessage_5);
        }

        if (g_bTXFlag_10) {
            g_bTXFlag_10 = false;
            g_ui32TXMsgCount++;
            got_tx_message(TX_10_ID, count, g_sCAN0TxMessage_10);
        }

        if (g_bTXFlag_100) {
            g_bTXFlag_100 = false;
            got_tx_message(TX_100_ID, count, g_sCAN0TxMessage_100);
        }

        if (g_bTXFlag_1000) {
            g_bTXFlag_1000 = false;
            g_ui32TXMsgCount++;
            got_tx_message(TX_1000_ID, count, g_sCAN0TxMessage_1000);
        }

        if (g_bTXFlag) {
            g_bTXFlag = false;
            g_ui32TXMsgCount++;
            got_tx_message(0, count, NULL);
        }

        if (g_bRXFlag) {
            g_bRXFlag = false;
            uint32_t msg_id;

            // Read the message
            CANMessageGet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, 0);
            msg_id = g_sCAN0RxMessage.ui32MsgID;

            if(g_sCAN0RxMessage.ui32Flags & MSG_OBJ_DATA_LOST) {
#if defined(VERBOSE)
                //UARTprintf("%d\tCAN message loss detected\n", count);
#endif
            }

            if (msg_id == 0xFF) {
                // The ID 0xFF is used for RESET message.
                do_reset(count, count_2, g_ui8RXMsgData[0]);
                count = count_2 = 0;
                continue;
            }

            count = got_rx_message(msg_id, count, &g_sCAN0RxMessage);

        } // g_bRXflag

        if (g_ui32ErrFlag) {
            CANErrorHandler();
        }
    } // while(1)
}
